// бібліотека яка дозволяє генерувати рядки на основі введеного патерну регулярного виразу
// використана у цілях економії часу написання власного мехіназму генерації
const RandExp = require("randexp");
// бібліотека яка дає можливості роботи з файлами
const fs = require("fs");

// асинхронна функція
// необхідна для того щоб дочекатися закінчення циклу та записати в файл згенеровані рядки
// інакше файл залишиться пустим через початкове значення list
(async () => {
  // кількість створених функцій ( компонент )
  const componentAmount = 5;
  // початкове значення тіла файлу ( списку компонент )
  let list = "";
  // цикл для генерації необхідної кількості компонент
  for (let i = 0; i < componentAmount; i++) {
    const Component = new RandExp(/function [A-Z]+ { return \( <> [a-z]+  <\/> \) } /).gen();
    list += Component;
  }
  console.log(list);
  // даний код записує список компонент до файлу
  await fs.writeFile("componentsList.txt", list, e => {
    if (e) throw new Error("something went wrong");
  });

})();
